#+TITLE: Intro to Python and Webscraping
#+Author: Robert Vesco
#+LaTeX_CLASS: beamer
#+BEAMER_THEME: Frankfurt
#+BEAMER_COLOR_THEME: beaver
#+BEAMER_FONT_THEME: professionalfonts
#+OPTIONS: H:2
#+OPTIONS: toc:nil
#+Latex_header: \input{preamble.tex}
#+Latex_header: \usepackage{attachfile2}
#+Latex_header: \setbeamertemplate{itemize/enumerate subbody begin}{\vspace{0.1cm}}
#+Latex_header: \setbeamertemplate{itemize/enumerate subbody end}{\vspace{0.1cm}}

** Testing Python Output

#+BEGIN_SRC python :exports both
a = ('b', 200)
b = ('x', 10)
c = ('q', -42)
return (a, b, c)
#+END_SRC

#+RESULTS:
| b | 200 |
| x |  10 |
| q | -42 |
** Python Output

#+BEGIN_SRC python
a = ('b', 200)
b = ('x', 10)
c = ('q', -42)
return (a, b, c)
#+END_SRC

#+RESULTS:
| b | 200 |
| x |  10 |
| q | -42 |

By removing the :exports both, you can export just the code and not the output. By replaceing it with :exports results, you can export the output without the source. 
